# სახელი
name = input("Enter your name: ")

#გვარი
surname = input("Enter your surname: ")

#ასაკი
age = int(input("Enter your age: "))

print("My name is " + name)
print("My surname is " + surname)
print("My age is ", age)

# int()- გამოიყენება იმისთვის რომ სტრიგი ან ფლოატი გადააქციოს ინტეჯერად(მთელ რიცხვად)
# String/სტრინგი - ""- ში მოქცეული მნიშვნელობა. გამოიყენება წინადადებების ასაწყობად. აქვს str() ფუნქცია რის დახმარებითაც ინტეჯერს ან ფლოატს გარდაქმნის სტრინად
# Integer/ინტეჯერი(მთელი რიცხვი) - არის მთელი რიცხვი.(მაგალითად 1,2,3,4 და ა.შ)გამოიყენება არითმეტიკულ ოპერაციებში.
# Float/ფლოატი(ათწილადი) - ასევე გამოიყენება არითმეტიკულ ოპერაციებში. აქვს float() ფუნქცია რის დახმარებითად სტრინგს გარდაქმნის ფლოატად(წილადად).
# input() - გამოიყენება როდესაც გვსურს რომ ცვლადს მნიშვნელობა თვით მომხმარებელმა მიანიჭოს. შეტანილი მნივნელობა სტრინგია.
# print() - ტერმინალში ბეჭდავს შეყვანილ მნიშვნელობას. 